{
  "mainTitle": "Телекоммуникационные технологии и сети",
  "table_of_contents": [
    {"title" :  "Глава 1. Введение в телекоммуникационные технологии",
      "content": ["1.1. Типы вычислительных сетей",
        "1.2. Эталонная модель взаимосвязи открытых систем",
        "1.3. Среды передачи данных"]
    },
    {
      "title": "Глава 2. Среды передачи данных",
      "content": ["2.1. Типы каналов передачи данных",
        "2.2. Эхо-компенсация",
        "2.3. Аналоговые каналы передачи данных",
        "2.4. Цифровые каналы передачи данных",
        "2.5. Контроль правильности передачи информации",
        "2.6. Протоколы канального уровня",
        "2.7. Проводные каналы",
        "2.8. Беспроводные каналы",
        "2.9. Каналы ISDN",
        "2.10. Абонентские линии",
        "2.11. Импульсно-кодовая модуляция",
        "2.12. Каналы PDH",
        "2.13. Каналы SDH",
        "2.14. Спутниковые каналы передачи данных",
        "2.15. Системы мобильной связи",
        "2.16. Bluetooth",
        "2.17. Протоколы модемной связи (физический уровень)",
        "2.18. Протоколы модемной связи (канальный уровень)",
        "2.19. Сжатие данных"]
    }
  ],
  "text": "Телематикой называют научно-техническую дисциплину, предметом\n              которой являются методы и средства передачи информации на\n              расстояния, существенно превышающие линейные размеры площади,\n              занимаемой участниками связи. Название дисциплины произошло из\n              частей слов \"телекоммуникации\" и \"информатика\". Active Server\n              Pages Современные телекоммуникационные технологии основаны на\n              использовании информационных сетей. Коммуникационная сеть —\n              система, состоящая из объектов, осуществляющих функции генерации,\n              преобразования, хранения и потребления продукта, называемых\n              пунктами (узлами) сети, и линий передачи (связей, коммуникаций,\n              соединений), осуществляющих передачу продукта между пунктами.\n              Отличительная особенность коммуникационной сети — большие\n              расстояния между пунктами по сравнению с геометрическими размерами\n              участков пространства, занимаемых пунктами. В качестве продукта\n              могут фигурировать информация, энергия, масса, и соответственно\n              различают группы сетей информационных, энергетических,\n              вещественных. В группах сетей возможно разделение на подгруппы.\n              Так, среди вещественных сетей могут быть выделены сети\n              транспортные, водопроводные, производственные и др. При\n              функциональном проектировании сетей решаются задачи синтеза\n              топологии, распределения продукта по узлам сети, а при\n              конструкторском проектировании выполняются размещение пунктов в\n              пространстве и проведение (трассировка) соединений. Информационная\n              сеть — коммуникационная сеть, в которой продуктом генерирования,\n              переработки, хранения и использования является информация.\n              Вычислительная сеть — информационная сеть, в состав которой входит\n              вычислительное оборудование. Компонентами вычислительной сети\n              могут быть ЭВМ и периферийные устройства, являющиеся источниками и\n              приемниками данных, передаваемых по сети. Эти компоненты\n              составляют оконечное оборудование данных (ООД или DTE — Data\n              Terminal Equipment). В качестве ООД могут выступать ЭВМ, принтеры,\n              плоттеры и другое вычислительное, измерительное и исполнительное\n              оборудование автоматических и автоматизированных систем.\n              Собственно пересылка данных происходит с помощью сред и средств,\n              объединяемых под названием среда передачи данных. Подготовка\n              данных, передаваемых или получаемых ООД от среды передачи данных,\n              осуществляется функциональным блоком, называемым аппаратурой\n              окончания канала данных (АКД или DCE — Data Circuit-Terminating\n              Equipment). АКД может быть конструктивно отдельным или встроенным\n              в ООД блоком. ООД и АКД вместе представляют собой станцию данных,\n              которую часто называют узлом сети. Примером АКД может служить\n              модем. Вычислительные сети классифицируются по ряду признаков. В\n              зависимости от расстояний между связываемыми узлами различают:\n              территориальные вычислительные сети — охватывают значительное\n              географическое пространство; среди территориальных сетей можно\n              выделить региональные вычислительные сети и глобальные\n              вычислительные сети, имеющие соответственно региональные или\n              глобальные масштабы; региональные сети иногда называют сетями MAN\n              (Metropolitan Area Network), а общее англоязычное название для\n              территориальных сетей — WAN (Wide Area Network); локальные\n              вычислительные сети (ЛВС) — охватывают ограниченную территорию\n              (обычно в пределах удаленности станций не более чем на несколько\n              десятков или сотен метров друг от друга, реже на 1...2 км);\n              локальные сети обозначают LAN (Local Area Network); корпоративные\n              вычислительные сети (масштаба предприятия) — совокупность\n              связанных между собой ЛВС, обслуживающих информационные\n              потребности предприятия и охватывающих территорию, на которой это\n              предприятие размещено. Особо выделяют единственную в своем роде\n              глобальную сеть Internet (реализованная в ней информационная\n              служба World Wide Web переводится на русский язык как \"всемирная\n              паутина\"); это сеть сетей со своей технологией. Существует понятие\n              интрасетей (intranet) — корпоративных сетей, использующих\n              технологии Internet, и extranet — сетей, внешних по отношению к\n              intranet. Различают интегрированные сети, неинтегрированные сети и\n              подсети. Интегрированная вычислительная сеть (интерсеть)\n              представляет собой взаимосвязанную совокупность многих\n              вычислительных сетей, которые в интерсети называются подсетями. В\n              автоматизированных системах крупных предприятий подсети включают\n              вычислительные средства отдельных подразделений. Интерсети нужны\n              для объединения таких подсетей, а также для объединения\n              технических средств автоматизированных систем проектирования и\n              производства в единую корпоративную информационную систему или,\n              другими словами, в систему комплексной автоматизации. Сети,\n              приспособленные для различных видов связи — телефонии, электронной\n              почты, передачи видеоинформации, цифровых данных и т.п.,\n              называются сетями интегрального обслуживания. Развитие интерсетей\n              заключается в разработке средств сопряжения разнородных подсетей и\n              стандартов для построения подсетей, изначально приспособленных к\n              сопряжению. В зависимости от способа управления различают сети\n              \"клиент/сервер\" и одноранговые сети. В сетях \"клиент/сервер\"\n              выделяется один или несколько узлов (их название — серверы),\n              выполняющих в сети управляющие или специальные обслуживающие\n              функции, а остальные узлы (клиенты) являются терминальными, в них\n              работают пользователи. Сети клиент/сервер различаются по характеру\n              распределения функций между серверами, другими словами по типам\n              серверов (например, файл-серверы, серверы баз данных). При\n              специализации серверов по определенным приложениям имеем сеть\n              распределенных вычислений. Такие сети отличают также от\n              централизованных систем, построенных на мэйнфреймах. В\n              одноранговых сетях все узлы равноправны; поскольку в общем случае\n              под клиентом понимается объект (устройство или программа),\n              запрашивающий некоторые услуги, а под сервером — объект,\n              предоставляющий эти услуги, то каждый узел в одноранговых сетях\n              может выполнять функции и клиента, и сервера. Все большую\n              популярность приобретает концепция \"тонких клиентов\", в\n              соответствии с которой пользователь имеет лишь дешевое\n              оборудование для обращения к удаленным компьютерам, а сеть\n              обслуживает заказы на выполнение вычислений и получение\n              информации. То есть пользователю не нужно приобретать программное\n              обеспечение для решения прикладных задач, ему нужно лишь платить\n              за выполненные заказы. Подобные компьютеры называют тонкими\n              клиентами или сетевыми компьютерами. Технология аренды\n              информационных услуг вместо создания собственной информационной\n              системы носит название технологии ASP (Application Service\n              Provider). Примечание: не путать с такой же аббревиатурой ASP\n              (Active Server Pages — активные серверные страницы). В зависимости\n              от того, одинаковые или неодинаковые ЭВМ применяют в сети,\n              различают сети однотипных ЭВМ, называемые однородными сетями, и\n              разнотипных ЭВМ — неоднородные сети (гетерогенные сети). В крупных\n              автоматизированных системах, как правило, сети оказываются\n              неоднородными. В зависимости от контингента пользователей сети\n              могут быть сетями общего пользования (public) или частными сетями\n              (private). Среди сетей общего пользования выделяют телефонные сети\n              ТфОП (PSTN — Public Switched Telephone Network) и сети передачи\n              данных (PSDN — Public Switched Data Network). Обмен сообщениями\n              между участниками сеанса связи без заметных временных задержек\n              характеризует режим работы on-line (\"на линии\"). При существенных\n              задержках имеем режим off-line (\"вне линии\"). Связь может быть\n              односторонней (симплексная связь), с попеременной передачей\n              информации в обоих направлениях (полудуплексная связь) или\n              одновременной в обоих направлениях (дуплексная связь). Сети также\n              различают в зависимости от используемых в них протоколов и по\n              способам коммутации. Под коммутацией данных понимается их\n              передача, при которой канал передачи данных (в этом случае его\n              называют коммутируемым каналом) может использоваться попеременно\n              для обмена информацией между различными пунктами информационной\n              сети в отличие от связи через некоммутируемые каналы, обычно\n              закрепленные за определенными абонентами. Различают следующие\n              способы коммутации данных: коммутация каналов — осуществляется\n              соединение ООД двух или более станций данных и обеспечивается\n              монопольное использование канала передачи данных до тех пор, пока\n              соединение не будет разомкнуто; коммутация сообщений —\n              характеризуется тем, что создание физического канала между\n              оконечными узлами необязательно и пересылка сообщений происходит\n              без нарушения их целостности. Вместо физического канала имеется\n              виртуальный канал, состоящий из физических участков, и между\n              участками возможна буферизация сообщения; коммутация пакетов —\n              сообщение передается по виртуальному каналу, но оно разделяется на\n              пакеты, при этом канал передачи данных занят только во время\n              передачи пакета (без нарушения его целостности) и по ее завершении\n              освобождается для передачи других пакетов. Коммутация каналов\n              характеризуется малой задержкой при передаче сообщений. После того\n              как канал скоммутирован, задержка определяется как сумма где —\n              расстояние между узлами отправителя и получателя, — скорость\n              распространения электромагнитных колебаний в среде передаче\n              сообщений, — скорость передачи данных в линии связи, — длина\n              передаваемого сообщения. В случае коммутации пакетов задержка\n              увеличивается, во-первых, из-за появления заголовков у всех\n              пакетов, что увеличивает суммарную длину передаваемых пакетов,\n              во-вторых, за счет буферизации пакетов и ожидания в очередях в\n              коммутаторах, в-третьих, за счет потерь времени на пакетизацию.\n              Однако общая производительность сети при коммутации каналов\n              оказывается низкой из-за обычных значительных пауз в обмене\n              данными между участниками связи. При коммутации пакетов эти паузы\n              заполняются передачей пакетов других сообщений, т.е. линии связи\n              разделяются многими узлами более эффективно. Коммутация пакетов\n              возможна с установлением и без установления соединения. При\n              коммутации с установлением соединения пакеты одного и того же\n              сообщения направляются по одному и тому же маршруту, выбираемому\n              маршрутизаторами предварительно во время процедуры установления\n              соединения. Маршрутизация без установления соединения, называемая\n              также дейтаграммной, выполняется без предварительного выбора\n              маршрута. При этом пакеты называют дейтаграммами. Дейтаграммы\n              передаются независимо друг от друга, каждая по своему маршруту,\n              выбираемому маршрутизаторами в зависимости от текущего состояния\n              сети. Поэтому дейтаграммы одного и того же сообщения могут\n              поступать к адресату в произвольной последовательности, что\n              требует дополнительных операций по сборке сообщения из дейтаграмм\n              в узле-получателе. На внутренних участках маршрута контроль\n              правильности передачи обычно не предусматривается и надежность\n              связи обеспечивается лишь контролем в оконечном узле."
}